'''Задача 1. Пазар за плодове
Линк към Judge: https://alpha.judge.softuni.org/contests/programming-basics-online-example-exam-8/1654/practice#1
Мария решава да мине на диета и отива до близкия пазар, за да купи ягоди, банани, портокали и малини. На конзолата се въвежда цената на ягодите в лв./кг. и количеството на бананите, портокалите, малините и ягодите, които трябва да закупи. Да се напише програма, която пресмята колко пари са ѝ необходими за да плати сметката, като знаете, че:
•	цената на малините е на половина по-ниска от тази на ягодите;
•	цената на портокалите е с 40% по-ниска от цената на малините;
•	цената на бананите е с 80% по-ниска от цената на малините.
Вход
От конзолата се четат 5 реда:
1.	Цена на ягодите в лева – реално число в интервала [0.00 … 10000.00]
2.	Количество на бананите в килограми – реално число в интервала [0.00 … 1 0000.00]
3.	Количество на портокалите в килограми – реално число в интервала [0.00 … 10000.00]
4.	Количество на малините в килограми – реално число в интервала [0.00 … 10000.00]
5.	Количество на ягодите в килограми – реално число в интервала [0.00 … 10000.00]
Изход
Да се отпечата на конзолата едно число:
•	парите, които са необходими на Мария.
Резултатът да се форматира до вторта цифра след десетичната запетая.
'''

price_strawberries = float(input())
bananas_qnt = float(input())
orange_qnt = float(input())
raspberry_qnt = float(input())
strawberry_qnt = float(input())

raspberry_price = price_strawberries / 2
orange_price = raspberry_price -  (raspberry_price * 0.40)
bananas_price = raspberry_price - (raspberry_price * 0.80)

sum = (price_strawberries * strawberry_qnt) + (bananas_qnt * bananas_price) + (orange_qnt * orange_price) + (raspberry_qnt * raspberry_price)

print(f"{sum:.2f}")
